bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128B3.xml
<?xml version="1.0" encoding="UTF-8"?>
<target-description-file>
    <variants>
        <variant ordercode="ATxmega128B3-AU" package="TQFP64" pinout="QFP_QFN_64" speedmax="32000000" tempmax="85"
                 tempmin="-40" vccmax="3.6" vccmin="1.6"/>
        <variant ordercode="ATxmega128B3-MH" package="QFN64" pinout="QFP_QFN_64" speedmax="32000000" tempmax="85"
                 tempmin="-40" vccmax="3.6" vccmin="1.6"/>
        <variant ordercode="ATxmega128B3-MCU" package="DRQFN64" pinout="DRQFN_64" speedmax="32000000" tempmax="85"
                 tempmin="-40" vccmax="3.6" vccmin="1.6"/>
    </variants>
    <device name="ATxmega128B3" architecture="AVR8_XMEGA" avr-family="AVR XMEGA" family="AVR8">
        <address-spaces>
            <address-space name="prog" id="prog" start="0x00000" size="0x22000" endianness="little">
                <memory-segment start="0x00000" size="0x20000" type="flash" rw="RW" exec="1" name="APP_SECTION"
                                pagesize="256"/>
                <memory-segment start="0x1E000" size="0x2000" type="flash" rw="RW" exec="1" name="APPTABLE_SECTION"
                                pagesize="256"/>
                <memory-segment start="0x20000" size="0x2000" type="flash" rw="RW" exec="1" name="BOOT_SECTION"
                                pagesize="256"/>
            </address-space>
            <address-space name="data" id="data" start="0x0000" size="0x4000" endianness="little">
                <memory-segment start="0x0000" size="0x1000" type="io" rw="RW" exec="0" name="IO"/>
                <memory-segment start="0x1000" size="0x0800" type="eeprom" rw="RW" exec="0" name="MAPPED_EEPROM"/>
                <memory-segment start="0x2000" size="0x2000" type="ram" rw="RW" exec="0" name="INTERNAL_SRAM"/>
            </address-space>
            <address-space name="eeprom" id="eeprom" start="0x00000" size="0x0800">
                <memory-segment start="0x00000" size="0x0800" type="eeprom" rw="RW" exec="0" name="EEPROM"
                                pagesize="32"/>
            </address-space>
            <address-space name="signatures" id="signatures" start="0x0000" size="0x0003">
                <memory-segment start="0x0000" size="0x0003" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
            </address-space>
            <address-space name="fuses" id="fuses" start="0x0000" size="0x0006">
                <memory-segment start="0x0000" size="0x0006" type="fuses" rw="RW" exec="0" name="FUSES"/>
            </address-space>
            <address-space name="lockbits" id="lockbits" start="0x0000" size="0x0001">
                <memory-segment start="0x0000" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
            </address-space>
            <address-space name="user_signatures" id="user_signatures" start="0x0000" size="0x0100">
                <memory-segment start="0x0000" size="0x0100" type="user_signatures" rw="RW" exec="0"
                                name="USER_SIGNATURES" pagesize="256"/>
            </address-space>
            <address-space name="prod_signatures" id="prod_signatures" start="0x0000" size="0x0034">
                <memory-segment start="0x0000" size="0x0034" type="other" rw="R" exec="0" name="PROD_SIGNATURES"
                                pagesize="256"/>
            </address-space>
        </address-spaces>
        <peripherals>
            <module name="GPIO" id="I6085" version="XMEGAD">
                <instance name="GPIO">
                    <register-group address-space="data" offset="0x0000" name-in-module="GPIO" name="GPIO"/>
                </instance>
            </module>
            <module name="VPORT" id="I6075" version="XMEGAAU">
                <instance name="VPORT0">
                    <register-group address-space="data" offset="0x0010" name-in-module="VPORT" name="VPORT0"/>
                </instance>
                <instance name="VPORT1">
                    <register-group address-space="data" offset="0x0014" name-in-module="VPORT" name="VPORT1"/>
                </instance>
                <instance name="VPORT2">
                    <register-group address-space="data" offset="0x0018" name-in-module="VPORT" name="VPORT2"/>
                </instance>
                <instance name="VPORT3">
                    <register-group address-space="data" offset="0x001C" name-in-module="VPORT" name="VPORT3"/>
                </instance>
            </module>
            <module name="XOCD" id="I6043">
                <instance name="OCD">
                    <register-group address-space="data" offset="0x002E" name-in-module="OCD" name="OCD"/>
                </instance>
            </module>
            <module name="CPU" id="I6000">
                <instance name="CPU">
                    <register-group address-space="data" offset="0x0030" name-in-module="CPU" name="CPU"/>
                    <parameters>
                        <param name="CORE_VERSION" value="V3XJ"/>
                    </parameters>
                </instance>
            </module>
            <module name="CLK" id="I6073" version="XMEGAB">
                <instance name="CLK">
                    <register-group address-space="data" offset="0x0040" name-in-module="CLK" name="CLK"/>
                    <signals>
                        <signal function="EXTERNAL_CLOCK" group="EXTCLK" index="0" pad="PC0"/>
                        <signal function="EXTERNAL_CLOCK" group="EXTCLK" index="1" pad="PC1"/>
                        <signal function="EXTERNAL_CLOCK" group="EXTCLK" index="2" pad="PC2"/>
                        <signal function="EXTERNAL_CLOCK" group="EXTCLK" index="3" pad="PC3"/>
                        <signal function="EXTERNAL_CLOCK" group="EXTCLK" index="4" pad="PC4"/>
                        <signal function="EXTERNAL_CLOCK" group="EXTCLK" index="5" pad="PC5"/>
                        <signal function="EXTERNAL_CLOCK" group="EXTCLK" index="6" pad="PC6"/>
                        <signal function="EXTERNAL_CLOCK" group="EXTCLK" index="7" pad="PC7"/>
                    </signals>
                </instance>
            </module>
            <module name="SLEEP" id="I6081" version="XMEGAAU">
                <instance name="SLEEP">
                    <register-group address-space="data" offset="0x0048" name-in-module="SLEEP" name="SLEEP"/>
