bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128B3.xml
            <module name="RTC" id="I6093">
                <instance name="RTC">
                    <register-group address-space="data" offset="0x0400" name-in-module="RTC" name="RTC"/>
                </instance>
            </module>
            <module name="TWI" id="I6089" version="XMEGAAU">
                <instance name="TWIC">
                    <register-group address-space="data" offset="0x480" name-in-module="TWI" name="TWIC"/>
                    <signals>
                        <signal function="TWI" group="SDA" pad="PC0"/>
                        <signal function="TWI" group="SCL" pad="PC1"/>
                    </signals>
                </instance>
            </module>
            <module name="USB" id="I3005" version="XMEGAAU">
                <instance name="USB">
                    <register-group address-space="data" offset="0x4C0" name-in-module="USB" name="USB"/>
                    <signals>
                        <signal function="USB" group="DN" pad="PD0"/>
                        <signal function="USB" group="DP" pad="PD1"/>
                    </signals>
                </instance>
            </module>
            <module name="PORT" id="I6075" version="XMEGAAU">
                <instance name="PORTB">
                    <register-group address-space="data" offset="0x0620" name-in-module="PORT" name="PORTB"/>
                    <signals>
                        <signal function="PORTB" group="P" index="0" pad="PB0"/>
                        <signal function="PORTB" group="P" index="1" pad="PB1"/>
                        <signal function="PORTB" group="P" index="2" pad="PB2"/>
                        <signal function="PORTB" group="P" index="3" pad="PB3"/>
                        <signal function="PORTB" group="P" index="4" pad="PB4"/>
                        <signal function="PORTB" group="P" index="5" pad="PB5"/>
                        <signal function="PORTB" group="P" index="6" pad="PB6"/>
                        <signal function="PORTB" group="P" index="7" pad="PB7"/>
                    </signals>
                </instance>
                <instance name="PORTC">
                    <register-group address-space="data" offset="0x0640" name-in-module="PORT" name="PORTC"/>
                    <signals>
                        <signal function="PORTC" group="P" index="0" pad="PC0"/>
                        <signal function="PORTC" group="P" index="1" pad="PC1"/>
                        <signal function="PORTC" group="P" index="2" pad="PC2"/>
                        <signal function="PORTC" group="P" index="3" pad="PC3"/>
                        <signal function="PORTC" group="P" index="4" pad="PC4"/>
                        <signal function="PORTC" group="P" index="5" pad="PC5"/>
                        <signal function="PORTC" group="P" index="6" pad="PC6"/>
                        <signal function="PORTC" group="P" index="7" pad="PC7"/>
                    </signals>
                </instance>
                <instance name="PORTD">
                    <register-group address-space="data" offset="0x0660" name-in-module="PORT" name="PORTD"/>
                    <signals>
                        <signal function="PORTD" group="P" index="0" pad="PD0"/>
                        <signal function="PORTD" group="P" index="1" pad="PD1"/>
                    </signals>
                </instance>
                <instance name="PORTG">
                    <register-group address-space="data" offset="0x06C0" name-in-module="PORT" name="PORTG"/>
                    <signals>
                        <signal function="PORTG" group="P" index="0" pad="PG0"/>
                        <signal function="PORTG" group="P" index="1" pad="PG1"/>
                        <signal function="PORTG" group="P" index="2" pad="PG2"/>
                        <signal function="PORTG" group="P" index="3" pad="PG3"/>
                        <signal function="PORTG" group="P" index="4" pad="PG4"/>
                        <signal function="PORTG" group="P" index="5" pad="PG5"/>
                        <signal function="PORTG" group="P" index="6" pad="PG6"/>
                        <signal function="PORTG" group="P" index="7" pad="PG7"/>
                    </signals>
                </instance>
                <instance name="PORTM">
                    <register-group address-space="data" offset="0x0760" name-in-module="PORT" name="PORTM"/>
                    <signals>
                        <signal function="PORTM" group="P" index="0" pad="PM0"/>
                        <signal function="PORTM" group="P" index="1" pad="PM1"/>
                        <signal function="PORTM" group="P" index="2" pad="PM2"/>
                        <signal function="PORTM" group="P" index="3" pad="PM3"/>
                        <signal function="PORTM" group="P" index="4" pad="PM4"/>
                        <signal function="PORTM" group="P" index="5" pad="PM5"/>
                        <signal function="PORTM" group="P" index="6" pad="PM6"/>
                        <signal function="PORTM" group="P" index="7" pad="PM7"/>
                    </signals>
                </instance>
                <instance name="PORTR">
                    <register-group address-space="data" offset="0x07E0" name-in-module="PORT" name="PORTR"/>
                    <signals>
                        <signal function="PORTR" group="P" index="0" pad="PR0"/>
                        <signal function="PORTR" group="P" index="1" pad="PR1"/>
                    </signals>
                </instance>
            </module>
            <module name="TC" id="I6090" version="XMEGAB">
                <instance name="TCC0">
                    <register-group address-space="data" offset="0x800" name-in-module="TC0" name="TCC0"/>
                    <signals>
                        <signal field="TC0A" function="TC0" group="OC0A" pad="PC0"/>
                        <signal field="TC0B" function="TC0" group="OC0B" pad="PC1"/>
                        <signal field="TC0C" function="TC0" group="OC0C" pad="PC2"/>
                        <signal field="TC0D" function="TC0" group="OC0D" pad="PC3"/>
                        <signal field="TC0A" function="TC0_ALT" group="OC0A" pad="PC4"/>
                        <signal field="TC0B" function="TC0_ALT" group="OC0B" pad="PC5"/>
                        <signal field="TC0C" function="TC0_ALT" group="OC0C" pad="PC6"/>
                        <signal field="TC0D" function="TC0_ALT" group="OC0D" pad="PC7"/>
                    </signals>
                </instance>
                <instance name="TCC1">
                    <register-group address-space="data" offset="0x840" name-in-module="TC1" name="TCC1"/>
                    <signals>
                        <signal function="TC1" group="OC1A" pad="PC4"/>
                        <signal function="TC1" group="OC1B" pad="PC5"/>
                    </signals>
                </instance>
            </module>
