bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128B3.xml
            <module name="TC2" id="I6090" version="XMEGAD">
                <instance name="TCC2">
                    <register-group address-space="data" offset="0x800" name-in-module="TC2" name="TCC2"/>
                    <signals>
                        <signal function="TC2" group="LOC2A" pad="PC0"/>
                        <signal function="TC2" group="LOC2B" pad="PC1"/>
                        <signal function="TC2" group="LOC2C" pad="PC2"/>
                        <signal function="TC2" group="LOC2D" pad="PC3"/>
                        <signal function="TC2" group="HOC2A" pad="PC4"/>
                        <signal function="TC2" group="HOC2B" pad="PC5"/>
                        <signal function="TC2" group="HOC2C" pad="PC6"/>
                        <signal function="TC2" group="HOC2D" pad="PC7"/>
                    </signals>
                </instance>
            </module>
            <module name="AWEX" id="I6090" version="XMEGAAU">
                <instance name="AWEXC">
                    <register-group address-space="data" offset="0x880" name-in-module="AWEX" name="AWEXC"/>
                    <signals>
                        <signal function="AWEX" group="OC0ALS" pad="PC0"/>
                        <signal function="AWEX" group="OC0AHS" pad="PC1"/>
                        <signal function="AWEX" group="OC0BLS" pad="PC2"/>
                        <signal function="AWEX" group="OC0BHS" pad="PC3"/>
                        <signal function="AWEX" group="OC0CLS" pad="PC4"/>
                        <signal function="AWEX" group="OC0CHS" pad="PC5"/>
                        <signal function="AWEX" group="OC0DLS" pad="PC6"/>
                        <signal function="AWEX" group="OC0DHS" pad="PC7"/>
                    </signals>
                </instance>
            </module>
            <module name="HIRES" id="I6090" version="XMEGAAU">
                <instance name="HIRESC">
                    <register-group address-space="data" offset="0x890" name-in-module="HIRES" name="HIRESC"/>
                </instance>
            </module>
            <module name="USART" id="I6090" version="XMEGAAU">
                <instance name="USARTC0">
                    <register-group address-space="data" offset="0x8A0" name-in-module="USART" name="USARTC0"/>
                    <signals>
                        <signal field="USART0" function="USART" group="XCK" pad="PC1"/>
                        <signal field="USART0" function="USART" group="RXD" pad="PC2"/>
                        <signal field="USART0" function="USART" group="TXD" pad="PC3"/>
                        <signal field="USART0" function="USART_ALT" group="XCK" pad="PC5"/>
                        <signal field="USART0" function="USART_ALT" group="RXD" pad="PC6"/>
                        <signal field="USART0" function="USART_ALT" group="TXD" pad="PC7"/>
                    </signals>
                </instance>
            </module>
            <module name="SPI" id="I6090" version="XMEGAAU">
                <instance name="SPIC">
                    <register-group address-space="data" offset="0x8C0" name-in-module="SPI" name="SPIC"/>
                    <signals>
                        <signal field="SPI" function="SPI" group="SS" pad="PC4"/>
                        <signal field="SPI" function="SPI" group="MOSI" pad="PC5"/>
                        <signal field="SPI" function="SPI" group="MISO" pad="PC6"/>
                        <signal field="SPI" function="SPI" group="SCK" pad="PC7"/>
                        <signal field="SPI" function="SPI_ALT" group="SS" pad="PC4"/>
                        <signal field="SPI" function="SPI_ALT" group="SCK" pad="PC5"/>
                        <signal field="SPI" function="SPI_ALT" group="MISO" pad="PC6"/>
                        <signal field="SPI" function="SPI_ALT" group="MOSI" pad="PC7"/>
                    </signals>
                </instance>
            </module>
            <module name="IRCOM" id="I6090" version="XMEGAB">
                <instance name="IRCOM">
                    <register-group address-space="data" offset="0x8F8" name-in-module="IRCOM" name="IRCOM"/>
                </instance>
            </module>
            <module name="LCD" id="I3003">
                <instance name="LCD">
                    <register-group address-space="data" offset="0x0D00" name-in-module="LCD" name="LCD"/>
                    <signals>
                        <signal function="LCD_SEG" group="SEG" index="24" pad="PG0"/>
                        <signal function="LCD_SEG" group="SEG" index="23" pad="PG1"/>
                        <signal function="LCD_SEG" group="SEG" index="22" pad="PG2"/>
                        <signal function="LCD_SEG" group="SEG" index="21" pad="PG3"/>
                        <signal function="LCD_SEG" group="SEG" index="20" pad="PG4"/>
                        <signal function="LCD_SEG" group="SEG" index="19" pad="PG5"/>
                        <signal function="LCD_SEG" group="SEG" index="18" pad="PG6"/>
                        <signal function="LCD_SEG" group="SEG" index="17" pad="PG7"/>
                        <signal function="LCD_SEG" group="SEG" index="16" pad="PM0"/>
                        <signal function="LCD_SEG" group="SEG" index="15" pad="PM1"/>
                        <signal function="LCD_SEG" group="SEG" index="14" pad="PM2"/>
                        <signal function="LCD_SEG" group="SEG" index="13" pad="PM3"/>
                        <signal function="LCD_SEG" group="SEG" index="12" pad="PM4"/>
                        <signal function="LCD_SEG" group="SEG" index="11" pad="PM5"/>
                        <signal function="LCD_SEG" group="SEG" index="10" pad="PM6"/>
                        <signal function="LCD_SEG" group="SEG" index="9" pad="PM7"/>
                        <signal function="LCD_SEG" group="SEG" index="8" pad="SEG8"/>
                        <signal function="LCD_SEG" group="SEG" index="7" pad="SEG7"/>
                        <signal function="LCD_SEG" group="SEG" index="6" pad="SEG6"/>
                        <signal function="LCD_SEG" group="SEG" index="5" pad="SEG5"/>
                        <signal function="LCD_SEG" group="SEG" index="4" pad="SEG4"/>
                        <signal function="LCD_SEG" group="SEG" index="3" pad="SEG3"/>
                        <signal function="LCD_SEG" group="SEG" index="2" pad="SEG2"/>
                        <signal function="LCD_SEG" group="SEG" index="1" pad="SEG1"/>
                        <signal function="LCD_SEG" group="SEG" index="0" pad="SEG0"/>
                        <signal function="LCD_BLINK" group="BLINK" index="1" pad="SEG1"/>
                        <signal function="LCD_BLINK" group="BLINK" index="0" pad="SEG0"/>
                        <signal function="LCD_BIAS" group="BIAS" index="1" pad="BIAS1"/>
                        <signal function="LCD_BIAS" group="BIAS" index="2" pad="BIAS2"/>
                        <signal function="LCD_BIAS" group="VLCD" pad="VLCD"/>
                        <signal function="LCD_BIAS" group="CAPL" pad="CAPL"/>
                        <signal function="LCD_BIAS" group="CAPH" pad="CAPH"/>
                        <signal function="LCD_COM" group="COM" index="0" pad="COM0"/>
                        <signal function="LCD_COM" group="COM" index="1" pad="COM1"/>
                        <signal function="LCD_COM" group="COM" index="2" pad="COM2"/>
                        <signal function="LCD_COM" group="COM" index="3" pad="COM3"/>
                        <signal function="LCD_COM_SWP" group="COM" index="0" pad="COM3"/>
                        <signal function="LCD_COM_SWP" group="COM" index="1" pad="COM2"/>
                        <signal function="LCD_COM_SWP" group="COM" index="2" pad="COM1"/>
                        <signal function="LCD_COM_SWP" group="COM" index="3" pad="COM0"/>
                    </signals>
                </instance>
            </module>
            <module name="FUSE" id="I6570" version="XMEGAAU">
                <instance name="FUSE">
                    <register-group address-space="fuses" offset="0x00" name-in-module="NVM_FUSES" name="FUSE"/>
