bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128B3.xml
                </instance>
            </module>
            <module name="LOCKBIT" id="I6570" version="XMEGAAU">
                <instance name="LOCKBIT">
                    <register-group address-space="lockbits" offset="0x00" name-in-module="NVM_LOCKBITS"
                                    name="LOCKBIT"/>
                </instance>
            </module>
            <module name="SIGROW" id="I3600" version="XMEGAB">
                <instance name="PROD_SIGNATURES">
                    <register-group address-space="prod_signatures" offset="0x00"
                                    name-in-module="NVM_PROD_SIGNATURES" name="PROD_SIGNATURES"/>
                </instance>
            </module>
        </peripherals>
        <interrupts>
            <interrupt-group index="1" module-instance="OSC" name-in-module="OSC"/>
            <interrupt-group index="2" module-instance="PORTC" name-in-module="PORT"/>
            <interrupt-group index="4" module-instance="PORTR" name-in-module="PORT"/>
            <interrupt-group index="6" module-instance="DMA" name-in-module="DMA"/>
            <interrupt-group index="10" module-instance="RTC" name-in-module="RTC"/>
            <interrupt-group index="12" module-instance="TWIC" name-in-module="TWI"/>
            <interrupt-group index="14" module-instance="TCC0" name-in-module="TC0"/>
            <interrupt-group index="14" module-instance="TCC2" name-in-module="TC2"/>
            <interrupt-group index="20" module-instance="TCC1" name-in-module="TC1"/>
            <interrupt-group index="24" module-instance="SPIC" name-in-module="SPI"/>
            <interrupt-group index="25" module-instance="USARTC0" name-in-module="USART"/>
            <interrupt-group index="31" module-instance="USB" name-in-module="USB"/>
            <interrupt-group index="35" module-instance="LCD" name-in-module="LCD"/>
            <interrupt-group index="36" module-instance="AES" name-in-module="AES"/>
            <interrupt-group index="37" module-instance="NVM" name-in-module="NVM"/>
            <interrupt-group index="39" module-instance="PORTB" name-in-module="PORT"/>
            <interrupt-group index="41" module-instance="ACB" name-in-module="AC"/>
            <interrupt-group index="44" module-instance="ADCB" name-in-module="ADC"/>
            <interrupt-group index="48" module-instance="PORTD" name-in-module="PORT"/>
            <interrupt-group index="50" module-instance="PORTG" name-in-module="PORT"/>
            <interrupt-group index="52" module-instance="PORTM" name-in-module="PORT"/>
        </interrupts>
        <interfaces>
            <interface type="pdi" name="PDI"/>
            <interface type="xmegajtag" name="JTAG"/>
        </interfaces>
        <property-groups>
            <property-group name="SIGNATURES">
                <property name="JTAGID" value="0x0974B03F"/>
                <property name="SIGNATURE0" value="0x1E"/>
                <property name="SIGNATURE1" value="0x97"/>
                <property name="SIGNATURE2" value="0x4B"/>
            </property-group>
            <property-group name="PDI_INTERFACE">
                <property name="APP_SECTION_OFFSET" value="0x00800000"/>
                <property name="APPTABLE_SECTION_OFFSET" value="0x0081E000"/>
                <property name="BOOT_SECTION_OFFSET" value="0x00820000"/>
                <property name="DATAMEM_OFFSET" value="0x01000000"/>
                <property name="EEPROM_OFFSET" value="0x008C0000"/>
                <property name="USER_SIGNATURES_OFFSET" value="0x008E0400"/>
                <property name="PROD_SIGNATURES_OFFSET" value="0x008E0200"/>
                <property name="FUSE_REGISTERS_OFFSET" value="0x008F0020"/>
                <property name="LOCK_REGISTERS_OFFSET" value="0x008F0027"/>
            </property-group>
        </property-groups>
    </device>
    <modules>
        <module name="GPIO" id="I6085" version="XMEGAD" caption="General Purpose IO">
            <register-group caption="General Purpose IO Registers" name="GPIO" size="4">
                <register caption="General Purpose IO Register 0" name="GPIOR0" offset="0x00" size="1"/>
                <register caption="General Purpose IO Register 1" name="GPIOR1" offset="0x01" size="1"/>
                <register caption="General Purpose IO Register 2" name="GPIOR2" offset="0x02" size="1"/>
                <register caption="General Purpose IO Register 3" name="GPIOR3" offset="0x03" size="1"/>
            </register-group>
        </module>
        <module name="VPORT" id="I6075" version="XMEGAAU" caption="Virtual Ports">
            <register-group caption="Virtual Port" name="VPORT" size="4">
                <register caption="I/O Port Data Direction" name="DIR" offset="0x00" size="1"/>
                <register caption="I/O Port Output" name="OUT" offset="0x01" size="1"/>
                <register caption="I/O Port Input" name="IN" offset="0x02" size="1"/>
                <register caption="Interrupt Flag Register" name="INTFLAGS" offset="0x03" size="1">
                    <bitfield caption="Port Interrupt 1 Flag" mask="0x02" name="INT1IF"/>
                    <bitfield caption="Port Interrupt 0 Flag" mask="0x01" name="INT0IF"/>
                </register>
            </register-group>
        </module>
        <module name="XOCD" caption="On-Chip Debug System" id="I6043">
            <register-group name="OCD" caption="On-Chip Debug System" size="2">
                <register name="OCDR0" caption="OCD Register 0" size="1" offset="0x00">
                    <bitfield name="OCDRD" caption="OCDR Dirty" mask="0xFF"/>
                </register>
                <register name="OCDR1" caption="OCD Register 1" size="1" offset="0x01">
                    <bitfield name="OCDRD" caption="OCDR Dirty" mask="0x01"/>
                </register>
            </register-group>
        </module>
        <module name="CPU" id="I6000" caption="CPU">
            <register-group caption="CPU registerMap" name="CPU" size="16">
                <register caption="Configuration Change Protection" name="CCP" offset="0x04" size="1">
                    <bitfield caption="CCP signature" mask="0xFF" name="CCP" values="CCP"/>
                </register>
                <register caption="Ramp D" name="RAMPD" offset="0x08" size="1"/>
                <register caption="Ramp X" name="RAMPX" offset="0x09" size="1"/>
