bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128B3.xml
            <value-group caption="External Oscillator Selection and Startup Time" name="OSC_XOSCSEL">
                <value caption="External Clock on port R1 - 6 CLK" name="EXTCLK" value="0x00"/>
                <value caption="External Clock on port C0 - 6 CLK" name="EXTCLK_C0" value="0x01"/>
                <value caption="External Clock on port C1 - 6 CLK" name="EXTCLK_C1" value="0x05"/>
                <value caption="External Clock on port C2 - 6 CLK" name="EXTCLK_C2" value="0x09"/>
                <value caption="External Clock on port C3 - 6 CLK" name="EXTCLK_C3" value="0x0D"/>
                <value caption="External Clock on port C4 - 6 CLK" name="EXTCLK_C4" value="0x11"/>
                <value caption="External Clock on port C5 - 6 CLK" name="EXTCLK_C5" value="0x15"/>
                <value caption="External Clock on port C6 - 6 CLK" name="EXTCLK_C6" value="0x19"/>
                <value caption="External Clock on port C7 - 6 CLK" name="EXTCLK_C7" value="0x1D"/>
                <value caption="32kHz TOSC - 32K CLK" name="32KHz" value="0x02"/>
                <value caption="0.4-16MHz XTAL - 256 CLK" name="XTAL_256CLK" value="0x03"/>
                <value caption="0.4-16MHz XTAL - 1K CLK" name="XTAL_1KCLK" value="0x07"/>
                <value caption="0.4-16MHz XTAL - 16K CLK" name="XTAL_16KCLK" value="0x0B"/>
            </value-group>
            <value-group caption="PLL Clock Source" name="OSC_PLLSRC">
                <value caption="Internal 2 MHz RC Oscillator" name="RC2M" value="0x00"/>
                <value caption="Internal 32 MHz RC Oscillator" name="RC32M" value="0x02"/>
                <value caption="External Oscillator" name="XOSC" value="0x03"/>
            </value-group>
            <value-group caption="2 MHz DFLL Calibration Reference" name="OSC_RC2MCREF">
                <value caption="Internal 32.768 kHz RC Oscillator" name="RC32K" value="0x00"/>
                <value caption="External 32.768 kHz Crystal Oscillator" name="XOSC32K" value="0x01"/>
            </value-group>
            <value-group caption="32 MHz DFLL Calibration Reference" name="OSC_RC32MCREF">
                <value caption="Internal 32.768 kHz RC Oscillator" name="RC32K" value="0x00"/>
                <value caption="External 32.768 kHz Crystal Oscillator" name="XOSC32K" value="0x01"/>
                <value caption="USB Start of Frame" name="USBSOF" value="0x02"/>
            </value-group>
            <interrupt-group name="OSC">
                <interrupt index="0" name="OSCF" caption="Oscillator Failure Interrupt (NMI)"/>
            </interrupt-group>
        </module>
        <module name="DFLL" id="I6055" version="XMEGAAU" caption="DFLL">
            <register-group caption="DFLL" name="DFLL" size="8">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="DFLL Enable" mask="0x01" name="ENABLE"/>
                </register>
                <register caption="Calibration Register A" name="CALA" offset="0x02" size="1">
                    <bitfield caption="DFLL Calibration Value A" mask="0x7F" name="CALL"/>
                </register>
                <register caption="Calibration Register B" name="CALB" offset="0x03" size="1">
                    <bitfield caption="DFLL Calibration Value B" mask="0x3F" name="CALH"/>
                </register>
                <register caption="Oscillator Compare Register 0" name="COMP0" offset="0x04" size="1"/>
                <register caption="Oscillator Compare Register 1" name="COMP1" offset="0x05" size="1"/>
                <register caption="Oscillator Compare Register 2" name="COMP2" offset="0x06" size="1"/>
            </register-group>
        </module>
        <module name="PR" id="I6080" version="XMEGAB" caption="Power Reduction">
            <register-group caption="Power Reduction" name="PR" size="6">
                <register caption="General Power Reduction" name="PRGEN" offset="0x00" size="1">
                    <bitfield caption="LCD Module" mask="0x80" name="LCD"/>
                    <bitfield caption="USB" mask="0x40" name="USB"/>
                    <bitfield caption="AES" mask="0x10" name="AES"/>
                    <bitfield caption="Real-time Counter" mask="0x04" name="RTC"/>
                    <bitfield caption="Event System" mask="0x02" name="EVSYS"/>
                    <bitfield caption="DMA-Controller" mask="0x01" name="DMA"/>
                </register>
                <register caption="Power Reduction Port A" name="PRPA" offset="0x01" size="1">
                    <bitfield caption="Port A ADC" mask="0x02" name="ADC"/>
                    <bitfield caption="Port A Analog Comparator" mask="0x01" name="AC"/>
                </register>
                <register caption="Power Reduction Port B" name="PRPB" offset="0x02" size="1">
                    <bitfield caption="Port B ADC" mask="0x02" name="ADC"/>
                    <bitfield caption="Port B Analog Comparator" mask="0x01" name="AC"/>
                </register>
                <register caption="Power Reduction Port C" name="PRPC" offset="0x03" size="1">
                    <bitfield caption="Port C Two-wire Interface" mask="0x40" name="TWI"/>
                    <bitfield caption="Port C USART0" mask="0x10" name="USART0"/>
                    <bitfield caption="Port C SPI" mask="0x08" name="SPI"/>
                    <bitfield caption="Port C AWEX" mask="0x04" name="HIRES"/>
                    <bitfield caption="Port C Timer/Counter1" mask="0x02" name="TC1"/>
                    <bitfield caption="Port C Timer/Counter0" mask="0x01" name="TC0"/>
                </register>
                <register caption="Power Reduction Port E" name="PRPE" offset="0x05" size="1">
                    <bitfield caption="Port E USART0" mask="0x10" name="USART0"/>
                    <bitfield caption="Port E Timer/Counter0" mask="0x01" name="TC0"/>
                </register>
            </register-group>
        </module>
