bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128B3.xml
        <module name="RST" id="I6083" version="XMEGAAU" caption="Reset">
            <register-group caption="Reset" name="RST" size="2">
                <register caption="Status Register" name="STATUS" offset="0x00" size="1">
                    <bitfield caption="Spike Detection Reset Flag" mask="0x40" name="SDRF"/>
                    <bitfield caption="Software Reset Flag" mask="0x20" name="SRF"/>
                    <bitfield caption="Programming and Debug Interface Interface Reset Flag" mask="0x10" name="PDIRF"/>
                    <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
                    <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
                    <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
                    <bitfield caption="Power-on Reset Flag" mask="0x01" name="PORF"/>
                </register>
                <register caption="Control Register" name="CTRL" offset="0x01" size="1">
                    <bitfield caption="Software Reset" mask="0x01" name="SWRST"/>
                </register>
            </register-group>
        </module>
        <module name="WDT" id="I6078" caption="Watch-Dog Timer">
            <register-group caption="Watch-Dog Timer" name="WDT" size="3">
                <register caption="Control" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Period" mask="0x3C" name="PER" values="WDT_PER"/>
                    <bitfield caption="Enable" mask="0x02" name="ENABLE"/>
                    <bitfield caption="Change Enable" mask="0x01" name="CEN"/>
                </register>
                <register caption="Windowed Mode Control" name="WINCTRL" offset="0x01" size="1">
                    <bitfield caption="Windowed Mode Period" mask="0x3C" name="WPER" values="WDT_WPER"/>
                    <bitfield caption="Windowed Mode Enable" mask="0x02" name="WEN"/>
                    <bitfield caption="Windowed Mode Change Enable" mask="0x01" name="WCEN"/>
                </register>
                <register caption="Status" name="STATUS" offset="0x02" size="1">
                    <bitfield caption="Syncronization busy" mask="0x01" name="SYNCBUSY"/>
                </register>
            </register-group>
            <value-group caption="Period setting" name="WDT_PER">
                <value caption="8 cycles (8ms @ 3.3V)" name="8CLK" value="0x00"/>
                <value caption="16 cycles (16ms @ 3.3V)" name="16CLK" value="0x01"/>
                <value caption="32 cycles (32ms @ 3.3V)" name="32CLK" value="0x02"/>
                <value caption="64 cycles (64ms @ 3.3V)" name="64CLK" value="0x03"/>
                <value caption="128 cycles (0.128s @ 3.3V)" name="128CLK" value="0x04"/>
                <value caption="256 cycles (0.256s @ 3.3V)" name="256CLK" value="0x05"/>
                <value caption="512 cycles (0.512s @ 3.3V)" name="512CLK" value="0x06"/>
                <value caption="1K cycles (1s @ 3.3V)" name="1KCLK" value="0x07"/>
                <value caption="2K cycles (2s @ 3.3V)" name="2KCLK" value="0x08"/>
                <value caption="4K cycles (4s @ 3.3V)" name="4KCLK" value="0x09"/>
                <value caption="8K cycles (8s @ 3.3V)" name="8KCLK" value="0x0A"/>
            </value-group>
            <value-group caption="Closed window period" name="WDT_WPER">
                <value caption="8 cycles (8ms @ 3.3V)" name="8CLK" value="0x00"/>
                <value caption="16 cycles (16ms @ 3.3V)" name="16CLK" value="0x01"/>
                <value caption="32 cycles (32ms @ 3.3V)" name="32CLK" value="0x02"/>
                <value caption="64 cycles (64ms @ 3.3V)" name="64CLK" value="0x03"/>
                <value caption="128 cycles (0.128s @ 3.3V)" name="128CLK" value="0x04"/>
                <value caption="256 cycles (0.256s @ 3.3V)" name="256CLK" value="0x05"/>
                <value caption="512 cycles (0.512s @ 3.3V)" name="512CLK" value="0x06"/>
                <value caption="1K cycles (1s @ 3.3V)" name="1KCLK" value="0x07"/>
                <value caption="2K cycles (2s @ 3.3V)" name="2KCLK" value="0x08"/>
                <value caption="4K cycles (4s @ 3.3V)" name="4KCLK" value="0x09"/>
                <value caption="8K cycles (8s @ 3.3V)" name="8KCLK" value="0x0A"/>
            </value-group>
        </module>
        <module name="MCU" id="I6091" version="XMEGAB" caption="MCU Control">
            <register-group caption="MCU Control" name="MCU" size="12">
                <register caption="Device ID byte 0" name="DEVID0" offset="0x00" size="1"/>
                <register caption="Device ID byte 1" name="DEVID1" offset="0x01" size="1"/>
                <register caption="Device ID byte 2" name="DEVID2" offset="0x02" size="1"/>
                <register caption="Revision ID" name="REVID" offset="0x03" size="1"/>
                <register caption="JTAG User ID" name="JTAGUID" offset="0x04" size="1"/>
                <register caption="MCU Control" name="MCUCR" offset="0x06" size="1">
                    <bitfield caption="JTAG Disable" mask="0x01" name="JTAGD"/>
                </register>
                <register caption="Analog Startup Delay" name="ANAINIT" offset="0x07" size="1">
                    <bitfield caption="Analog startup delay Port B" mask="0x0C" name="STARTUPDLYB"/>
                    <bitfield caption="Analog startup delay Port A" mask="0x03" name="STARTUPDLYA"/>
                </register>
                <register caption="Event System Lock" name="EVSYSLOCK" offset="0x08" size="1">
                    <bitfield caption="Event Channel 4-7 Lock" mask="0x10" name="EVSYS1LOCK"/>
                    <bitfield caption="Event Channel 0-3 Lock" mask="0x01" name="EVSYS0LOCK"/>
                </register>
                <register caption="AWEX Lock" name="AWEXLOCK" offset="0x09" size="1">
                    <bitfield caption="AWeX on T/C C0 Lock" mask="0x01" name="AWEXCLOCK"/>
                </register>
            </register-group>
        </module>
        <module name="PMIC" caption="Programmable Multi-level Interrupt Controller" id="I6057">
            <register-group name="PMIC" caption="Programmable Multi-level Interrupt Controller" size="16">
                <register name="STATUS" caption="Status Register" size="1" offset="0x00">
                    <bitfield name="NMIEX" caption="Non-maskable Interrupt Executing" mask="0x80"/>
                    <bitfield name="HILVLEX" caption="High Level Interrupt Executing" mask="0x04"/>
                    <bitfield name="MEDLVLEX" caption="Medium Level Interrupt Executing" mask="0x02"/>
                    <bitfield name="LOLVLEX" caption="Low Level Interrupt Executing" mask="0x01"/>
                </register>
