bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128B3.xml
                <register caption="AES State Register" name="STATE" offset="0x02" size="1"/>
                <register caption="AES Key Register" name="KEY" offset="0x03" size="1"/>
                <register caption="AES Interrupt Control Register" name="INTCTRL" offset="0x04" size="1">
                    <bitfield caption="Interrupt level" mask="0x03" name="INTLVL" values="AES_INTLVL"/>
                </register>
            </register-group>
            <value-group caption="Interrupt level" name="AES_INTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <interrupt-group name="AES">
                <interrupt index="0" name="INT" caption="AES Interrupt"/>
            </interrupt-group>
        </module>
        <module name="CRC" id="I6111" version="XMEGAB" caption="Cyclic Redundancy Checker">
            <register-group caption="Cyclic Redundancy Checker" name="CRC" size="8">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Reset" mask="0xC0" name="RESET" values="CRC_RESET"/>
                    <bitfield caption="CRC Mode" mask="0x20" name="CRC32"/>
                    <bitfield caption="Input Source" mask="0x0F" name="SOURCE" values="CRC_SOURCE"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x01" size="1">
                    <bitfield caption="Zero detection" mask="0x02" name="ZERO"/>
                    <bitfield caption="Busy" mask="0x01" name="BUSY"/>
                </register>
                <register caption="Data Input" name="DATAIN" offset="0x03" size="1"/>
                <register caption="Checksum byte 0" name="CHECKSUM0" offset="0x04" size="1"/>
                <register caption="Checksum byte 1" name="CHECKSUM1" offset="0x05" size="1"/>
                <register caption="Checksum byte 2" name="CHECKSUM2" offset="0x06" size="1"/>
                <register caption="Checksum byte 3" name="CHECKSUM3" offset="0x07" size="1"/>
            </register-group>
            <value-group caption="Reset" name="CRC_RESET">
                <value caption="No Reset" name="NO" value="0x00"/>
                <value caption="Reset CRC with CHECKSUM to all zeros" name="RESET0" value="0x02"/>
                <value caption="Reset CRC with CHECKSUM to all ones" name="RESET1" value="0x03"/>
            </value-group>
            <value-group caption="Input Source" name="CRC_SOURCE">
                <value caption="Disabled" name="DISABLE" value="0x00"/>
                <value caption="I/O Interface" name="IO" value="0x01"/>
                <value caption="Flash" name="FLASH" value="0x02"/>
                <value caption="DMAC Channel 0" name="DMAC0" value="0x04"/>
                <value caption="DMAC Channel 1" name="DMAC1" value="0x05"/>
            </value-group>
        </module>
        <module name="DMA" id="I3000" version="XMEGAB" caption="DMA Controller">
            <register-group caption="DMA Channel" name="DMA_CH" size="16">
                <register caption="Channel Control" name="CTRLA" offset="0x00" size="1">
                    <bitfield caption="Channel Enable" mask="0x80" name="CHEN"/>
                    <bitfield caption="Channel Software Reset" mask="0x40" name="CHRST"/>
                    <bitfield caption="Channel Repeat Mode" mask="0x20" name="REPEAT"/>
                    <bitfield caption="Channel Transfer Request" mask="0x10" name="TRFREQ"/>
                    <bitfield caption="Channel Single Shot Data Transfer" mask="0x04" name="SINGLE"/>
                    <bitfield caption="Channel Transfer Mode" mask="0x03" name="BURSTLEN" values="DMA_CH_BURSTLEN"/>
                </register>
                <register caption="Channel Control" name="CTRLB" offset="0x01" size="1">
                    <bitfield caption="Block Transfer Busy" mask="0x80" name="CHBUSY"/>
                    <bitfield caption="Block Transfer Pending" mask="0x40" name="CHPEND"/>
                    <bitfield caption="Block Transfer Error Interrupt Flag" mask="0x20" name="ERRIF"/>
                    <bitfield caption="Transaction Complete Interrupt Flag" mask="0x10" name="TRNIF"/>
                    <bitfield caption="Transfer Error Interrupt Level" mask="0x0C" name="ERRINTLVL"
                              values="DMA_CH_ERRINTLVL"/>
                    <bitfield caption="Transaction Complete Interrupt Level" mask="0x03" name="TRNINTLVL"
                              values="DMA_CH_TRNINTLVL"/>
                </register>
                <register caption="Address Control" name="ADDRCTRL" offset="0x02" size="1">
                    <bitfield caption="Channel Source Address Reload" mask="0xC0" name="SRCRELOAD"
                              values="DMA_CH_SRCRELOAD"/>
                    <bitfield caption="Channel Source Address Mode" mask="0x30" name="SRCDIR" values="DMA_CH_SRCDIR"/>
                    <bitfield caption="Channel Destination Address Reload" mask="0x0C" name="DESTRELOAD"
                              values="DMA_CH_DESTRELOAD"/>
                    <bitfield caption="Channel Destination Address Mode" mask="0x03" name="DESTDIR"
                              values="DMA_CH_DESTDIR"/>
                </register>
                <register caption="Channel Trigger Source" name="TRIGSRC" offset="0x03" size="1">
                    <bitfield caption="Channel Trigger Source" mask="0xFF" name="TRIGSRC" values="DMA_CH_TRIGSRC"/>
                </register>
                <register caption="Channel Block Transfer Count" name="TRFCNT" offset="0x04" size="2"/>
                <register caption="Channel Repeat Count" name="REPCNT" offset="0x06" size="1"/>
                <register caption="Channel Source Address 0" name="SRCADDR0" offset="0x08" size="1"/>
                <register caption="Channel Source Address 1" name="SRCADDR1" offset="0x09" size="1"/>
                <register caption="Channel Destination Address 0" name="DESTADDR0" offset="0x0C" size="1"/>
                <register caption="Channel Destination Address 1" name="DESTADDR1" offset="0x0D" size="1"/>
            </register-group>
            <register-group caption="DMA Controller" name="DMA" size="48">
                <register caption="Control" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Enable" mask="0x80" name="ENABLE"/>
                    <bitfield caption="Software Reset" mask="0x40" name="RESET"/>
                    <bitfield caption="Double Buffering Mode" mask="0x04" name="DBUFMODE" values="DMA_DBUFMODE"/>
                    <bitfield caption="Channel Priority Mode" mask="0x01" name="PRIMODE" values="DMA_PRIMODE"/>
                </register>
                <register caption="Transfer Interrupt Status" name="INTFLAGS" offset="0x03" size="1">
                    <bitfield caption="Channel 1 Block Transfer Error Interrupt Flag" mask="0x20" name="CH1ERRIF"/>
                    <bitfield caption="Channel 0 Block Transfer Error Interrupt Flag" mask="0x10" name="CH0ERRIF"/>
                    <bitfield caption="Channel 1 Transaction Complete Interrupt Flag" mask="0x02" name="CH1TRNIF"/>
                    <bitfield caption="Channel 0 Transaction Complete Interrupt Flag" mask="0x01" name="CH0TRNIF"/>
                </register>
                <register caption="Status" name="STATUS" offset="0x04" size="1">
                    <bitfield caption="Channel 1 Block Transfer Busy" mask="0x20" name="CH1BUSY"/>
                    <bitfield caption="Channel 0 Block Transfer Busy" mask="0x10" name="CH0BUSY"/>
                    <bitfield caption="Channel 1 Block Transfer Pending" mask="0x02" name="CH1PEND"/>
                    <bitfield caption="Channel 0 Block Transfer Pending" mask="0x01" name="CH0PEND"/>
                </register>
                <register caption="Temporary Register For 16-bit Access" name="TEMP" offset="0x06" size="2"/>
                <register-group caption="DMA Channel 0" name="CH0" offset="0x10" name-in-module="DMA_CH"/>
                <register-group caption="DMA Channel 1" name="CH1" offset="0x20" name-in-module="DMA_CH"/>
            </register-group>
            <value-group caption="Burst mode" name="DMA_CH_BURSTLEN">
                <value caption="1-byte burst mode" name="1BYTE" value="0x00"/>
                <value caption="2-byte burst mode" name="2BYTE" value="0x01"/>
                <value caption="4-byte burst mode" name="4BYTE" value="0x02"/>
                <value caption="8-byte burst mode" name="8BYTE" value="0x03"/>
            </value-group>
            <value-group caption="Source address reload mode" name="DMA_CH_SRCRELOAD">
                <value caption="No reload" name="NONE" value="0x00"/>
                <value caption="Reload at end of block" name="BLOCK" value="0x01"/>
                <value caption="Reload at end of burst" name="BURST" value="0x02"/>
                <value caption="Reload at end of transaction" name="TRANSACTION" value="0x03"/>
            </value-group>
            <value-group caption="Source addressing mode" name="DMA_CH_SRCDIR">
                <value caption="Fixed" name="FIXED" value="0x00"/>
                <value caption="Increment" name="INC" value="0x01"/>
                <value caption="Decrement" name="DEC" value="0x02"/>
            </value-group>
