bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128B3.xml
            <value-group caption="Destination address reload mode" name="DMA_CH_DESTRELOAD">
                <value caption="No reload" name="NONE" value="0x00"/>
                <value caption="Reload at end of block" name="BLOCK" value="0x01"/>
                <value caption="Reload at end of burst" name="BURST" value="0x02"/>
                <value caption="Reload at end of transaction" name="TRANSACTION" value="0x03"/>
            </value-group>
            <value-group caption="Destination addressing mode" name="DMA_CH_DESTDIR">
                <value caption="Fixed" name="FIXED" value="0x00"/>
                <value caption="Increment" name="INC" value="0x01"/>
                <value caption="Decrement" name="DEC" value="0x02"/>
            </value-group>
            <value-group caption="Transfer trigger source" name="DMA_CH_TRIGSRC">
                <value caption="Off software triggers only" name="OFF" value="0x00"/>
                <value caption="Event System Channel 0" name="EVSYS_CH0" value="0x01"/>
                <value caption="Event System Channel 1" name="EVSYS_CH1" value="0x02"/>
                <value caption="Event System Channel 2" name="EVSYS_CH2" value="0x03"/>
                <value caption="AES" name="AES" value="0x04"/>
                <value caption="ADCA Channel 0" name="ADCA_CH0" value="0x10"/>
                <value caption="ADCB Channel 0" name="ADCB_CH0" value="0x20"/>
                <value caption="Timer/Counter C0 Overflow" name="TCC0_OVF" value="0x40"/>
                <value caption="Timer/Counter C0 Error" name="TCC0_ERR" value="0x41"/>
                <value caption="Timer/Counter C0 Compare or Capture A" name="TCC0_CCA" value="0x42"/>
                <value caption="Timer/Counter C0 Compare or Capture B" name="TCC0_CCB" value="0x43"/>
                <value caption="Timer/Counter C0 Compare or Capture C" name="TCC0_CCC" value="0x44"/>
                <value caption="Timer/Counter C0 Compare or Capture D" name="TCC0_CCD" value="0x45"/>
                <value caption="Timer/Counter C1 Overflow" name="TCC1_OVF" value="0x46"/>
                <value caption="Timer/Counter C1 Error" name="TCC1_ERR" value="0x47"/>
                <value caption="Timer/Counter C1 Compare or Capture A" name="TCC1_CCA" value="0x48"/>
                <value caption="Timer/Counter C1 Compare or Capture B" name="TCC1_CCB" value="0x49"/>
                <value caption="SPI C Transfer Complete" name="SPIC" value="0x4A"/>
                <value caption="USART C0 Receive Complete" name="USARTC0_RXC" value="0x4B"/>
                <value caption="USART C0 Data Register Empty" name="USARTC0_DRE" value="0x4C"/>
                <value caption="Timer/Counter E0 Overflow" name="TCE0_OVF" value="0x80"/>
                <value caption="Timer/Counter E0 Error" name="TCE0_ERR" value="0x81"/>
                <value caption="Timer/Counter E0 Compare or Capture A" name="TCE0_CCA" value="0x82"/>
                <value caption="Timer/Counter E0 Compare or Capture B" name="TCE0_CCB" value="0x83"/>
                <value caption="Timer/Counter E0 Compare or Capture C" name="TCE0_CCC" value="0x84"/>
                <value caption="Timer/Counter E0 Compare or Capture D" name="TCE0_CCD" value="0x85"/>
                <value caption="USART E0 Receive Complete" name="USARTE0_RXC" value="0x8B"/>
                <value caption="USART E0 Data Register Empty" name="USARTE0_DRE" value="0x8C"/>
            </value-group>
            <value-group caption="Double buffering mode" name="DMA_DBUFMODE">
                <value caption="Double buffering disabled" name="DISABLED" value="0x00"/>
                <value caption="Double buffering enabled on channel 0/1" name="CH01" value="0x01"/>
            </value-group>
            <value-group caption="Priority mode" name="DMA_PRIMODE">
                <value caption="Round Robin" name="RR01" value="0x00"/>
                <value caption="Channel 0 &gt; channel 1" name="CH0RR1" value="0x01"/>
            </value-group>
            <value-group caption="Interrupt level" name="DMA_CH_ERRINTLVL">
                <value caption="Interrupt disabled" name="OFF" value="0x00"/>
                <value caption="Low level" name="LO" value="0x01"/>
                <value caption="Medium level" name="MED" value="0x02"/>
                <value caption="High level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Interrupt level" name="DMA_CH_TRNINTLVL">
                <value caption="Interrupt disabled" name="OFF" value="0x00"/>
                <value caption="Low level" name="LO" value="0x01"/>
                <value caption="Medium level" name="MED" value="0x02"/>
                <value caption="High level" name="HI" value="0x03"/>
            </value-group>
            <interrupt-group name="DMA">
                <interrupt index="0" name="CH0" caption="Channel 0 Interrupt"/>
                <interrupt index="1" name="CH1" caption="Channel 1 Interrupt"/>
            </interrupt-group>
        </module>
        <module name="EVSYS" id="I6061" version="XMEGAB" caption="Event System">
            <register-group caption="Event System" name="EVSYS" size="18">
                <register caption="Event Channel 0 Multiplexer" name="CH0MUX" offset="0x00" size="1">
                    <bitfield caption="Event Channel 0 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
                </register>
                <register caption="Event Channel 1 Multiplexer" name="CH1MUX" offset="0x01" size="1">
                    <bitfield caption="Event Channel 1 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
                </register>
                <register caption="Event Channel 2 Multiplexer" name="CH2MUX" offset="0x02" size="1">
                    <bitfield caption="Event Channel 2 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
                </register>
                <register caption="Event Channel 3 Multiplexer" name="CH3MUX" offset="0x03" size="1">
                    <bitfield caption="Event Channel 3 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
                </register>
