bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128B3.xml
            <value-group caption="Negative input multiplexer selection when gain on 4 MSB pins" name="ADC_CH_MUXNEGH">
                <value caption="Input pin 4" name="PIN4" value="0x00"/>
                <value caption="Input pin 5" name="PIN5" value="0x01"/>
                <value caption="Input pin 6" name="PIN6" value="0x02"/>
                <value caption="Input pin 7" name="PIN7" value="0x03"/>
                <value caption="Internal ground" name="INTGND" value="0x04"/>
                <value caption="PAD ground" name="GND" value="0x07"/>
            </value-group>
            <value-group caption="Input mode" name="ADC_CH_INPUTMODE">
                <value caption="Internal inputs, no gain (INPUTMODE = 0)" name="INTERNAL" value="0x00"/>
                <value caption="Single-ended input, no gain (INPUTMODE = 1)" name="SINGLEENDED" value="0x01"/>
                <value caption="Differential input, no gain (INPUTMODE = 2)" name="DIFF" value="0x02"/>
                <value caption="Differential input, with gain (INPUTMODE = 3)" name="DIFFWGAIN" value="0x03"/>
            </value-group>
            <value-group caption="Gain factor" name="ADC_CH_GAIN">
                <value caption="1x gain" name="1X" value="0x00"/>
                <value caption="2x gain" name="2X" value="0x01"/>
                <value caption="4x gain" name="4X" value="0x02"/>
                <value caption="8x gain" name="8X" value="0x03"/>
                <value caption="16x gain" name="16X" value="0x04"/>
                <value caption="32x gain" name="32X" value="0x05"/>
                <value caption="64x gain" name="64X" value="0x06"/>
                <value caption="x/2 gain" name="DIV2" value="0x07"/>
            </value-group>
            <value-group caption="Conversion result resolution" name="ADC_RESOLUTION">
                <value caption="12-bit right-adjusted result" name="12BIT" value="0x00"/>
                <value caption="8-bit right-adjusted result" name="8BIT" value="0x02"/>
                <value caption="12-bit left-adjusted result" name="LEFT12BIT" value="0x03"/>
            </value-group>
            <value-group caption="Voltage reference selection" name="ADC_REFSEL">
                <value caption="Internal 1V" name="INT1V" value="0x00"/>
                <value caption="Internal VCC / 1.6" name="INTVCC" value="0x01"/>
                <value caption="External reference on PORT A" name="AREFA" value="0x02"/>
                <value caption="External reference on PORT B" name="AREFB" value="0x03"/>
                <value caption="Internal VCC / 2" name="INTVCC2" value="0x04"/>
            </value-group>
            <value-group caption="Event channel input selection" name="ADC_EVSEL">
                <value caption="Event Channel 0" name="0" value="0x00"/>
                <value caption="Event Channel 1" name="1" value="0x01"/>
                <value caption="Event Channel 2" name="2" value="0x02"/>
                <value caption="Event Channel 3" name="3" value="0x03"/>
            </value-group>
            <value-group caption="Event action selection" name="ADC_EVACT">
                <value caption="No event action" name="NONE" value="0x00"/>
                <value caption="First event triggers channel 0" name="CH0" value="0x01"/>
                <value caption="The ADC is flushed and restarted for accurate timing" name="SYNCSWEEP" value="0x06"/>
            </value-group>
            <value-group caption="Interrupt mode" name="ADC_CH_INTMODE">
                <value caption="Interrupt on conversion complete" name="COMPLETE" value="0x00"/>
                <value caption="Interrupt on result below compare value" name="BELOW" value="0x01"/>
                <value caption="Interrupt on result above compare value" name="ABOVE" value="0x03"/>
            </value-group>
            <value-group caption="Interrupt level" name="ADC_CH_INTLVL">
                <value caption="Interrupt disabled" name="OFF" value="0x00"/>
                <value caption="Low level" name="LO" value="0x01"/>
                <value caption="Medium level" name="MED" value="0x02"/>
                <value caption="High level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Clock prescaler" name="ADC_PRESCALER">
                <value caption="Divide clock by 4" name="DIV4" value="0x00"/>
                <value caption="Divide clock by 8" name="DIV8" value="0x01"/>
                <value caption="Divide clock by 16" name="DIV16" value="0x02"/>
                <value caption="Divide clock by 32" name="DIV32" value="0x03"/>
                <value caption="Divide clock by 64" name="DIV64" value="0x04"/>
                <value caption="Divide clock by 128" name="DIV128" value="0x05"/>
                <value caption="Divide clock by 256" name="DIV256" value="0x06"/>
                <value caption="Divide clock by 512" name="DIV512" value="0x07"/>
            </value-group>
            <interrupt-group name="ADC">
                <interrupt index="0" name="CH0" caption="Interrupt 0"/>
            </interrupt-group>
        </module>
        <module name="AC" id="I6077" version="XMEGAB" caption="Analog Comparator">
            <register-group caption="Analog Comparator" name="AC" size="10">
                <register caption="Analog Comparator 0 Control" name="AC0CTRL" offset="0x00" size="1">
                    <bitfield caption="Interrupt Mode" mask="0xC0" name="INTMODE" values="AC_INTMODE"/>
                    <bitfield caption="Interrupt Level" mask="0x30" name="INTLVL" values="AC_INTLVL"/>
                    <bitfield caption="Hysteresis Mode" mask="0x06" name="HYSMODE" values="AC_HYSMODE"/>
                    <bitfield caption="Enable" mask="0x01" name="ENABLE"/>
                </register>
                <register caption="Analog Comparator 1 Control" name="AC1CTRL" offset="0x01" size="1">
                    <bitfield caption="Interrupt Mode" mask="0xC0" name="INTMODE" values="AC_INTMODE"/>
                    <bitfield caption="Interrupt Level" mask="0x30" name="INTLVL" values="AC_INTLVL"/>
                    <bitfield caption="Hysteresis Mode" mask="0x06" name="HYSMODE" values="AC_HYSMODE"/>
                    <bitfield caption="Enable" mask="0x01" name="ENABLE"/>
                </register>
                <register caption="Analog Comparator 0 MUX Control" name="AC0MUXCTRL" offset="0x02" size="1">
                    <bitfield caption="MUX Positive Input" mask="0x38" name="MUXPOS" values="AC_MUXPOS"/>
                    <bitfield caption="MUX Negative Input" mask="0x07" name="MUXNEG" values="AC_MUXNEG"/>
                </register>
