bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128B3.xml
                <register caption="Address Mask Register" name="ADDRMASK" offset="0x05" size="1">
                    <bitfield caption="Address Mask" mask="0xFE" name="ADDRMASK"/>
                    <bitfield caption="Address Enable" mask="0x01" name="ADDREN"/>
                </register>
            </register-group>
            <register-group caption="Two-Wire Interface" name="TWI" size="14">
                <register caption="TWI Common Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="SDA Hold Time Enable" mask="0x06" name="SDAHOLD" values="TWI_SDAHOLD"/>
                    <bitfield caption="External Driver Interface Enable" mask="0x01" name="EDIEN"/>
                </register>
                <register-group caption="TWI master module" name="MASTER" offset="0x0001" name-in-module="TWI_MASTER"/>
                <register-group caption="TWI slave module" name="SLAVE" offset="0x0008" name-in-module="TWI_SLAVE"/>
            </register-group>
            <value-group caption="SDA Hold Time" name="TWI_SDAHOLD">
                <value caption="SDA Hold Time off" name="OFF" value="0x00"/>
                <value caption="SDA Hold Time 50 ns" name="50NS" value="0x01"/>
                <value caption="SDA Hold Time 300 ns" name="300NS" value="0x02"/>
                <value caption="SDA Hold Time 400 ns" name="400NS" value="0x03"/>
            </value-group>
            <value-group caption="Master Interrupt Level" name="TWI_MASTER_INTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Inactive Timeout" name="TWI_MASTER_TIMEOUT">
                <value caption="Bus Timeout Disabled" name="DISABLED" value="0x00"/>
                <value caption="50 Microseconds" name="50US" value="0x01"/>
                <value caption="100 Microseconds" name="100US" value="0x02"/>
                <value caption="200 Microseconds" name="200US" value="0x03"/>
            </value-group>
            <value-group caption="Master Command" name="TWI_MASTER_CMD">
                <value caption="No Action" name="NOACT" value="0x00"/>
                <value caption="Issue Repeated Start Condition" name="REPSTART" value="0x01"/>
                <value caption="Receive or Transmit Data" name="RECVTRANS" value="0x02"/>
                <value caption="Issue Stop Condition" name="STOP" value="0x03"/>
            </value-group>
            <value-group caption="Master Bus State" name="TWI_MASTER_BUSSTATE">
                <value caption="Unknown Bus State" name="UNKNOWN" value="0x00"/>
                <value caption="Bus is Idle" name="IDLE" value="0x01"/>
                <value caption="This Module Controls The Bus" name="OWNER" value="0x02"/>
                <value caption="The Bus is Busy" name="BUSY" value="0x03"/>
            </value-group>
            <value-group caption="Slave Interrupt Level" name="TWI_SLAVE_INTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Slave Command" name="TWI_SLAVE_CMD">
                <value caption="No Action" name="NOACT" value="0x00"/>
                <value caption="Used To Complete a Transaction" name="COMPTRANS" value="0x02"/>
                <value caption="Used in Response to Address/Data Interrupt" name="RESPONSE" value="0x03"/>
            </value-group>
            <interrupt-group name="TWI">
                <interrupt index="0" name="TWIS" caption="TWI Slave Interrupt"/>
                <interrupt index="1" name="TWIM" caption="TWI Master Interrupt"/>
            </interrupt-group>
        </module>
        <module name="USB" id="I3005" version="XMEGAAU" caption="USB">
            <register-group caption="USB Endpoint" name="USB_EP" size="8">
                <register caption="Endpoint Status" name="STATUS" offset="0x00" size="1">
                    <bitfield caption="Endpoint Stall Flag" mask="0x80" name="STALLF"/>
                    <bitfield caption="CRC Error Flag" mask="0x80" name="CRC"/>
                    <bitfield caption="Underflow Enpoint FLag" mask="0x40" name="UNF"/>
                    <bitfield caption="Overflow Enpoint Flag for Output Endpoints" mask="0x40" name="OVF"/>
                    <bitfield caption="Transaction Complete 0 Flag" mask="0x20" name="TRNCOMPL0"/>
                    <bitfield caption="Transaction Complete 1 Flag" mask="0x10" name="TRNCOMPL1"/>
                    <bitfield caption="SETUP Transaction Complete Flag" mask="0x10" name="SETUP"/>
                    <bitfield caption="Bank Select" mask="0x08" name="BANK"/>
                    <bitfield caption="Data Buffer 1 Not Acknowledge" mask="0x04" name="BUSNACK1"/>
                    <bitfield caption="Data Buffer 0 Not Acknowledge" mask="0x02" name="BUSNACK0"/>
                    <bitfield caption="Data Toggle" mask="0x01" name="TOGGLE"/>
                </register>
                <register caption="Endpoint Control" name="CTRL" offset="0x01" size="1">
                    <bitfield caption="Endpoint Type" mask="0xC0" name="TYPE" values="USB_EP_TYPE"/>
                    <bitfield caption="Multi Packet Transfer Enable" mask="0x20" name="MULTIPKT"/>
                    <bitfield caption="Ping-Pong Enable" mask="0x10" name="PINGPONG"/>
                    <bitfield caption="Interrupt Disable" mask="0x08" name="INTDSBL"/>
                    <bitfield caption="Data Stall" mask="0x04" name="STALL"/>
                    <bitfield caption="Data Buffer Size" mask="0x07" name="BUFSIZE" values="USB_EP_BUFSIZE"/>
                </register>
                <register caption="USB Endpoint Counter" name="CNT" offset="0x02" size="2">
                    <bitfield caption="Zero Length Packet" mask="0x8000" name="ZLP"/>
                </register>
                <register caption="Data Pointer" name="DATAPTR" offset="0x04" size="2"/>
