bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128B3.xml
            <value-group caption="SPI Mode" name="SPI_MODE">
                <value caption="SPI Mode 0" name="0" value="0x00"/>
                <value caption="SPI Mode 1" name="1" value="0x01"/>
                <value caption="SPI Mode 2" name="2" value="0x02"/>
                <value caption="SPI Mode 3" name="3" value="0x03"/>
            </value-group>
            <value-group caption="Prescaler setting" name="SPI_PRESCALER">
                <value caption="System Clock / 4" name="DIV4" value="0x00"/>
                <value caption="System Clock / 16" name="DIV16" value="0x01"/>
                <value caption="System Clock / 64" name="DIV64" value="0x02"/>
                <value caption="System Clock / 128" name="DIV128" value="0x03"/>
            </value-group>
            <value-group caption="Interrupt level" name="SPI_INTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <interrupt-group name="SPI">
                <interrupt index="0" name="INT" caption="SPI Interrupt"/>
            </interrupt-group>
        </module>
        <module name="IRCOM" id="I6090" version="XMEGAB" caption="IR Communication Module">
            <register-group caption="IR Communication Module" name="IRCOM" size="3">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Event Channel Select" mask="0x0F" name="EVSEL" values="IRDA_EVSEL"/>
                </register>
                <register caption="IrDA Transmitter Pulse Length Control Register" name="TXPLCTRL" offset="0x01"
                          size="1"/>
                <register caption="IrDA Receiver Pulse Length Control Register" name="RXPLCTRL" offset="0x02" size="1"/>
            </register-group>
            <value-group caption="Event channel selection" name="IRDA_EVSEL">
                <value caption="No Event Source" name="OFF" value="0x00"/>
                <value caption="Event Channel 0" name="0" value="0x08"/>
                <value caption="Event Channel 1" name="1" value="0x09"/>
                <value caption="Event Channel 2" name="2" value="0x0A"/>
                <value caption="Event Channel 3" name="3" value="0x0B"/>
            </value-group>
        </module>
        <module name="LCD" id="I3003" caption="LCD Controller">
            <register-group caption="LCD Controller" name="LCD" size="36">
                <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
                    <bitfield caption="LCD Enable" mask="0x80" name="ENABLE"/>
                    <bitfield caption="External Register Bias Generation" mask="0x40" name="XBIAS"/>
                    <bitfield caption="Data Register Lock" mask="0x20" name="DATCLK"/>
                    <bitfield caption="Common Bus Swap" mask="0x10" name="COMSWP"/>
                    <bitfield caption="Segment Bus Swap" mask="0x08" name="SEGSWP"/>
                    <bitfield caption="Clear Data Register" mask="0x04" name="CLRDT"/>
                    <bitfield caption="Segments On" mask="0x02" name="SEGON"/>
                    <bitfield caption="Blanking Display Mode" mask="0x01" name="BLANK"/>
                </register>
                <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
                    <bitfield caption="LCD Prescaler Select" mask="0x80" name="PRESC" values="LCD_PRESC"/>
                    <bitfield caption="LCD Clock Divide" mask="0x70" name="CLKDIV" values="LCD_CLKDIV"/>
                    <bitfield caption="Low Power Waveform" mask="0x08" name="LPWAV"/>
                    <bitfield caption="Duty Select" mask="0x03" name="DUTY" values="LCD_DUTY"/>
                </register>
                <register caption="Control Register C" name="CTRLC" offset="0x02" size="1">
                    <bitfield caption="LCD Port Mask" mask="0x3F" name="PMSK"/>
                </register>
                <register caption="Interrupt Enable Register" name="INTCTRL" offset="0x03" size="1">
                    <bitfield caption="eXtended Interrupt Mode Enable" mask="0xF8" name="XIME"/>
                    <bitfield caption="Interrupt Level" mask="0x03" name="FCINTLVL" values="LCD_INTLVL"/>
                </register>
                <register caption="Interrupt Flag Register" name="INTFLAG" offset="0x04" size="1">
                    <bitfield caption="LCD Frame Completed Interrupt Flag" mask="0x01" name="FCIF"/>
                </register>
                <register caption="Control Register D" name="CTRLD" offset="0x05" size="1">
                    <bitfield caption="Blink Enable" mask="0x08" name="BLINKEN"/>
                    <bitfield caption="LCD Blink Rate" mask="0x03" name="BLINKRATE" values="LCD_BLINKRATE"/>
                </register>
                <register caption="Control Register E" name="CTRLE" offset="0x06" size="1">
                    <bitfield caption="Blink Pixel Selection 1" mask="0xF0" name="BPS1"/>
                    <bitfield caption="Blink Pixel Selection 0" mask="0x0F" name="BPS0"/>
                </register>
                <register caption="Control Register F" name="CTRLF" offset="0x07" size="1">
                    <bitfield caption="Fine Contrast" mask="0x3F" name="FCONT"/>
                </register>
                <register caption="Control Register G" name="CTRLG" offset="0x08" size="1">
                    <bitfield caption="Type of Digit" mask="0xC0" name="TDG" values="LCD_TDG"/>
                    <bitfield caption="Start Segment" mask="0x3F" name="STSEG"/>
                </register>
                <register caption="Control Register H" name="CTRLH" offset="0x09" size="1">
                    <bitfield caption="Decrement of Start Segment" mask="0x80" name="DEC"/>
                    <bitfield caption="Display Code" mask="0x7F" name="DCODE"/>
                </register>
                <register caption="LCD Data Register 0" name="DATA0" offset="0x10" size="1"/>
                <register caption="LCD Data Register 1" name="DATA1" offset="0x11" size="1"/>
